# MinorLapSpliceLength Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricSheetType..::..MinorLapSpliceLength Property
FabricSheetType Class See Also
---
The lap splice length in the minor direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinorLapSpliceLength { get; set; }
```

Visual Basic
---
```text
Public Property MinorLapSpliceLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinorLapSpliceLength {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: minorLapSpliceLength is greater than the half of the overall width. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace